from random import *
answers = ['Бесспорно', 'Мне кажется - да', 'Пока не ясно, попробуй снова', 'Даже не думай',
'Предрешено', 'Вероятнее всего', 'Спроси позже', 'Мой ответ - нет', 'Никаких сомнений',
'Хорошие перспективы', 'Лучше не рассказывать', 'По моим данным - нет', 'Определённо да',
'Знаки говорят - да', 'Сейчас нельзя предсказать', 'Перспективы не очень хорошие',
'Можешь быть уверен в этом', 'Да', 'Сконцентрируйся и спроси опять', 'Весьма сомнительно']
print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.')
name = input('Как тебя звать?: ')
print(f'Привет {name}')
repeat = 'да'
while repeat == 'да':
    quest = input('Введите вопрос: ')
    print(choice(answers))
    repeat = input("Хотите задать ещё один вопрос? Введите 'да' или 'нет': ")
    if repeat != 'да':
        print('Возвращайся если возникнут вопросы!')


